[UI_TREE]
EDITCfg = تحرير الإعدادات
MARKCfg = إعدادات الوسم
3DCfg = 3D
ImportDxf_Type0Cfg = إعدادات استيراد DXF
SysCfg = إعدادات أخرى

[Edit]
EDIT = تحرير الإعدادات
PointFilterPrecis = دقة نقطة التصفية (مم)
PointFilterAngle = زاوية المرشح (بالدرجات)
PointPrecisMoveStep = خطوة حركة النقطة (مم)
MICRO = خطوة الضبط الدقيق للموضع (مم)
MICROROTATE = زاوية حجم خطوة الضبط الدقيق (بالدرجات)
CLICK = دقة الالتقاط (مم)
UNDO = عدد المراحل التي تم التراجع عنها عدد المراحل
ONETOTWO = دقة نقطة التوقف (مم)
ExtendSpace = دقة القياس (مم)
KillAngleSpace = دقة زاوية التوجيه (مم)
PreViewZoomScale = معاينة التكبير
LayerCnt = عدد المستويات
JoinDistance = أقصى مسافة دمج المنحنى
FastDrawEnable = يظهر خط التعبئة تسريع
FastDrawEnableOption = إيقاف|تفعيل

[MARK]
MARK = وضع العلامات على الإعدادات
SafeDoorRemark = ما إذا كان باب الأمان مغلقا وما إذا كان يجب الاستمرار في وضع العلامات
SafeDoorRemarkOption = لا | نعم
CloseRedIfMark = ما إذا كان يتم إيقاف تشغيل الضوء الأحمر تلقائيا عند وضع علامة
CloseRedIfMarkOption = لا | نعم
RedPreviewLayerNo = سرعة وسم معاينة الضوء الأحمر

[3D]
3D = إعدادات 3D 
3dModelPrecision = دقة معالجة النموذج ثلاثي الأبعاد
3dTrancePrecision = دقة تحويل البيانات ثلاثية الأبعاد
STLOptimize = تحسين خريطة نموذج STL
STLOptimizeOption = لا | نعم

[ImportDxf_Type0]
ImportDxf_Type0=إعدادات استيراد DXF
SepArc = دقة القوس (5 ~ 255)
SepSpLine = دقة المفتاح (5 ~ 255)

[Sys]
Sys = إعدادات أخرى
CIRCLEPRECIS = دقة القوس (مم)
SAMPLECOUNT = عدد العينات لكل جزء من القوس
AIIMPORTPRECIS=الذكاء الاصطناعي دقة استيراد الملفات (مم)
PowerFill = تحسين سرعة التعبئة
PowerFillOption = لا | نعم
PowerDraw = تحسين سرعة الرسم
PowerDrawOption = لا | نعم
PowerRPViewFrame = تحسين حدود معاينة الضوء الأحمر
PowerRPViewFrameOption = لا | نعم

[UI_FACE]
ExportSysPara = تصدير المعلمة ...
ImportSysPara = معلمة الاستيراد ...
Ok = موافق
Cancel = إلغاء
Apply = تطبيق

;3DCALI DLG MAIN
[DLG_6000]
1019=وضع علامة على إعداد المعلمة
1021 = بدء وضع العلامات
1022 = معاينة الضوء الأحمر
1023 = علامة دائرية
1024=ملف تصحيح التصدير
1025=استيراد ملف تصحيح
1027=النقطة المرجعية للمحرك
1028 = الحد الأدنى لموضع التعديل
1029 = الحد الأقصى لموضع التعديل
1030 = الزيادة المصححة
1031 = البعد البؤري المسند
1033=إعداد المعلمة
6000 = نوع التصحيح
6001=المعلمات الأساسية
6002 = موضع المحرك
3=إنشاء ملف تصحيح
4=إعادة تعيين

; 3DCALI DLG PARAM
[DLG_140]
1035 = عدد العلامات
1036=سرعة الوسم (مم/ثانية)
1037 = سرعة القفز (مم / ثانية)
1038 = تردد Q (كيلو هرتز)
1039=Q الإصدار (الولايات المتحدة)
1040=التيار (أ)
1041 = الطاقة (٪)
1042=الوضع
1051=التطبيق
2=إلغاء


;3DCALI STRING
[STRINGTABLE]

Motor position = موقف للسيارات 

Current focus = التركيز الحالي 

Wrong motor parameters = موتور المعلمة خطأ 

Motor movement failure = موتور حركة الفشل 

Motor increment out of range (0.01mm~5mm) = زيادة المحرك خارج نطاق ( 0.01mm ~ 5mm ) 

Focus of base plane out of range (>0mm) = البعد البؤري مسند الطائرة خارج نطاق ( > 0mm ) 

Generating cali file false: Unable to open/create file  = فشل إنشاء ملف تصحيح: غير قادر على فتح / إنشاء ملف 

Generating cali file false: Unable to write file = فشل توليد تصحيح الملف : لا يمكن كتابة الملف 

Stop Marking = توقف مارك 

Start Marking = تبدأ العلامات 

Failed to stop marking = فشل في وقف وسم 

Failed to start marking = فشل في وقف وضع العلامات 

Export success = تصدير بنجاح 

Export failed: Can not find cali file or copy file failed = فشل التصدير: تعذر العثور على ملف التصحيح أو فشل ملف النسخ

Import failed: Cali file does not exist = فشل الاستيراد: ملف التصحيح غير موجود

Import failed: Unknow = فشل الاستيراد : خطأ غير معروف 

Cali file already exists, do you want to replace it = تصحيح الملف موجود بالفعل ، هل تريد الكتابة ؟ 

Import success = استيراد بنجاح 

Import failed: Please manually copy the cali file to the '\\EMCC\\caliset\\%cardID%\\' directory= فشل الاستيراد : يرجى نسخ ملف التصحيح يدويا إلى ' emcc caliset \\ \\ % بطاقة الهوية \\ \\ دليل 

Data is not enough, please input at lease 2 rows = عدد قليل جدا من البيانات ، يرجى إدخال ما لا يقل عن سطرين من البيانات 

Generation of cali file succeeded = توليد تصحيح الملف بنجاح 

Error: Handle of device.dll is null = خطأ: المقبض .dll الجهاز فارغ

Error: Card number wrong = خطأ: الرقم التسلسلي للبطاقة غير صحيح

Error: Load device.dll or API failed = خطأ : فشل تحميل الجهاز دلل أو API 

Path of cali file wrong or SystemSet.ini not found  = لم يتم العثور على خطأ في دليل ملف التصحيح أو مجموعة .ini النظام

Error: Open 3dmarker.dat failed = خطأ: فشل فتح ملف 3dmarker.dat

Error: Open .dat failed = خطأ: فشل فتح .dat الملف

Error: Enter mark environment failed = خطأ: فشل الدخول إلى بيئة وضع العلامات

Error: Leave mark environment failed = خطأ: فشل مغادرة بيئة وضع العلامات
